{"class_name": "Functional", "config": {"name": "Full_Model_FCO2", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 16], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Normalization", "config": {"name": "normalization", "trainable": true, "dtype": "float32", "axis": [-1], "mean": [10.681650161743164, 84.23094940185547, 221.58773803710938, 856.802001953125, 0.16775739192962646, 11.717645645141602, 11.572123527526855, 11.348167419433594, 1.5317480564117432, 169.05213928222656, -0.8715507388114929, 2.8086564540863037, 183.14313648807195, 0.500452959214096, 0.0008636422891409204, 0.8002917168317674], "variance": [47.444485037493905, 240.3803945037398, 134442.04238269106, 88579.93216846976, 0.013518535773274165, 27.58596180258087, 25.75677013239533, 13.029591309555144, 1.3427086018058532, 7028.559080204228, 271.02563731490227, 15.309075277549766, 11119.580473199801, 0.08331503886917666, 1.0000074017510678, 0.02660517758912398]}, "name": "normalization", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 160, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense", "inbound_nodes": [[["normalization", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_1", "inbound_nodes": [[["dense", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_1", 0, 0]]}, "keras_version": "2.9.0", "backend": "tensorflow"}