{"class_name": "Functional", "config": {"name": "Pruned_Model_FCO2", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 16], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Normalization", "config": {"name": "normalization", "trainable": true, "dtype": "float32", "axis": [-1], "mean": [2.625382286161824, 11.430408007671353, -5.225690492427197, 14.531383397386401, 11.310696196396643, 11.268754581009743, 82.27115114010087, 213.2555384373996, 82.27115114010088, 14.531383397386405, 10.442128104530418, 11.26875458100974, 1.9742443563307202, 173.02975793017282, -5.225690492427198, 0.16249497841081198], "variance": [14.802135925572685, 25.7919300832386, 109.94801332925408, 643.5162237584242, 23.999404110815465, 12.383227379966796, 31621.268724178444, 123921.7016516708, 31621.268724178444, 643.5162237584242, 48.725915169442416, 12.383227379966794, 2.464841652981612, 7130.577052571122, 109.94801332925408, 0.013467103724553998]}, "name": "normalization", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 160, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense", "inbound_nodes": [[["normalization", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_1", "inbound_nodes": [[["dense", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_1", 0, 0]]}, "keras_version": "2.9.0", "backend": "tensorflow"}